In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [6]:
## Wildfire Prediction Using Machine Learning

In [7]:
# A Python project created by Tyler Astle

In [14]:
df = pd.read_csv("QUERIEDWFdata.csv")

In [15]:
df.head()

   1  2005-02-02 00:00:00  063
0  2  2004-05-12 00:00:00   61
1  3  2004-05-31 00:00:00   17
2  4  2004-06-28 00:00:00    3
3  5  2004-06-28 00:00:00    3
4  6  2004-06-30 00:00:00    5

In [16]:
df.tail()

                 1  2005-02-02 00:00:00  063
1202311  300308673  2015-10-05 00:00:00   67
1202312  300308674  2015-10-21 00:00:00    9
1202313  300308675  2015-11-27 00:00:00   65
1202314  300308676  2015-11-21 00:00:00   19
1202315  300308678  2015-10-07 00:00:00   45